# Data cleaning
importer pandas et le dataset

In [16]:
import pandas as pd

In [17]:
chemin = "Https://bit.ly/world-cities-clean"
data = pd.read_csv(chemin)

In [18]:
data.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

les raccourcis clavier
sur les cellules :
m pour transformer en markdown
y pour du code
r pour du raw (code non executable)
a creer une cellule au dessus
b creer une cellule en dessous
dd supprimer la cellule

## exo 1 les lectures de csv qui n'existent pas

In [19]:
chemin1 = "./oui"
data1 = pd.read_csv(chemin1)

FileNotFoundError: [Errno 2] No such file or directory: './oui'

FileNotFoundError: [Errno 2] No such file or directory: '.\\oui'

le dossier ou fichier n'a pas ete trouve

il faut mettre un chemin valide qui mene a un fichier existant

## exo2 on a perdu la tete

In [21]:
chemin2 = "Https://bit.ly/world-cities-dirty-v1"
data2 = pd.read_csv(chemin2)

In [22]:
data2.head()

       les Escaldes               Andorra Escaldes-Engordany  3040051
0  Andorra la Vella               Andorra   Andorra la Vella  3041563
1    Umm al Qaywayn  United Arab Emirates     Umm al Qaywayn   290594
2    Ras al-Khaimah  United Arab Emirates    Raʼs al Khaymah   291074
3      Khawr Fakkān  United Arab Emirates       Ash Shāriqah   291696
4             Dubai  United Arab Emirates              Dubai   292223

le nom des colonne est incorrect mais il n'y a pas de message d'erreur

In [23]:
data2 = pd.read_csv(chemin2,names=['name','country','subcountry','geonameid'])

In [24]:
data2.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

## exo 3 lorem ipsum (ad lib)

In [25]:
chemin3 = "Https://bit.ly/world-cities-dirty-v2"
data3 = pd.read_csv(chemin3)
data3

,,,,,,Lorem ipsum dolor sit amet,consectetur adipiscing elit,sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam,quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident,sunt in culpa qui officia deserunt mollit anim id est laborum.
Sed ut perspiciatis unde omnis iste natus error sit voluptatem accusantium doloremque laudantium,totam rem aperiam,eaque ipsa quae ab illo inventore veritatis et quasi architecto beatae vitae dicta sunt explicabo. Nemo enim ipsam voluptatem quia voluptas sit aspernatur aut odit aut fugit,sed quia consequuntur magni dolores eos qui ratione voluptatem sequi nesciunt. Neque porro quisquam est,qui dolorem ipsum quia dolor sit amet,consectetur,adipisci velit,sed quia non numquam eius modi tempora incidu...,quis nostrum exercitationem ullam corporis su...,nisi ut aliquid ex ea commodi consequatur? Qu...,vel illum qui dolorem eum fugiat quo voluptas...
name,country,subcountry,geonameid,NaN,NaN,NaN,NaN,NaN,NaN,NaN
les Escaldes,Andorra,Escaldes-Engordany,3040051,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Andorra la Vella,Andorra,Andorra la Vella,3041563,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Umm al Qaywayn,United Arab Emirates,Umm al Qaywayn,290594,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
Bindura,Zimbabwe,Mashonaland Central,895061,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Beitbridge,Zimbabwe,Matabeleland South,895269,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Epworth,Zimbabwe,Harare,1085510,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Chitungwiza,Zimbabwe,Harare,1106542,NaN,NaN,NaN,NaN,NaN,NaN,NaN
At vero eos et accusamus et iusto odio dignissimos ducimus qui blanditiis praesentium voluptatum deleniti atque corrupti quos dolores et quas molestias excepturi sint occaecati cupiditate non provident,similique sunt in culpa qui officia deserunt mollitia animi,id est laborum et dolorum fuga. Et harum quidem rerum facilis est et expedita distinctio. Nam libero tempore,cum soluta nobis est eligendi optio cumque nihil impedit quo minus id quod maxime placeat facere possimus,omnis voluptas assumenda est,omnis dolor repellendus. Temporibus autem quibusdam et aut officiis debitis aut rerum necessitatibus saepe eveniet ut et voluptates repudiandae sint et molestiae non recusandae. Itaque earum rerum hic tenetur a sapiente delectus,ut aut reiciendis voluptatibus maiores alias ...,NaN,NaN,NaN,NaN

on a un lorem ipsum en nom de colonnes et en premiere et derniere ligne

In [26]:
chemin3 = "Https://bit.ly/world-cities-dirty-v2"
data3 = pd.read_csv(chemin3,skiprows=2,skipfooter=1)
data3

<ipython-input-26-d838235c124e>:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  data3 = pd.read_csv(chemin3,skiprows=2,skipfooter=1)

                   name               country           subcountry  geonameid
0          les Escaldes               Andorra   Escaldes-Engordany    3040051
1      Andorra la Vella               Andorra     Andorra la Vella    3041563
2        Umm al Qaywayn  United Arab Emirates       Umm al Qaywayn     290594
3        Ras al-Khaimah  United Arab Emirates      Raʼs al Khaymah     291074
4          Khawr Fakkān  United Arab Emirates         Ash Shāriqah     291696
...                 ...                   ...                  ...        ...
23013          Bulawayo              Zimbabwe             Bulawayo     894701
23014           Bindura              Zimbabwe  Mashonaland Central     895061
23015        Beitbridge              Zimbabwe   Matabeleland South     895269
23016           Epworth              Zimbabwe               Harare    1085510
23017       Chitungwiza              Zimbabwe               Harare    1106542

[23018 rows x 4 columns]

si on a un probleme d'encodage il faut rajouter ,encode='utf-8' au read csv

## exo 4 separation difficile

In [27]:
chemin4 = "Https://bit.ly/world-cities-dirty-v3"
data4 = pd.read_csv(chemin4)
data4.head()

     les Escaldes|Andorra|Escaldes-Engordany|3040051
0  Andorra la Vella|Andorra|Andorra la Vella|3041563
1  Umm al Qaywayn|United Arab Emirates|Umm al Qay...
2  Ras al-Khaimah|United Arab Emirates|Raʼs al Kh...
3  Khawr Fakkān|United Arab Emirates|Ash Shāriqah...
4            Dubai|United Arab Emirates|Dubai|292223

In [28]:
data4.tail()

      les Escaldes|Andorra|Escaldes-Engordany|3040051
23012               Bulawayo|Zimbabwe|Bulawayo|894701
23013     Bindura|Zimbabwe|Mashonaland Central|895061
23014   Beitbridge|Zimbabwe|Matabeleland South|895269
23015                 Epworth|Zimbabwe|Harare|1085510
23016             Chitungwiza|Zimbabwe|Harare|1106542

ici on a un probleme ou au lieu d'avoir des , pour delimiter on a des | et y a pas de nom de colonnes

In [29]:
chemin4 = "Https://bit.ly/world-cities-dirty-v3"
data4 = pd.read_csv(chemin4, delimiter='|',names=['name','country','subcountry','geonameid'])
data4.head()

               name               country          subcountry  geonameid
0      les Escaldes               Andorra  Escaldes-Engordany    3040051
1  Andorra la Vella               Andorra    Andorra la Vella    3041563
2    Umm al Qaywayn  United Arab Emirates      Umm al Qaywayn     290594
3    Ras al-Khaimah  United Arab Emirates     Raʼs al Khaymah     291074
4      Khawr Fakkān  United Arab Emirates        Ash Shāriqah     291696

In [30]:
data4.tail()

              name   country           subcountry  geonameid
23013     Bulawayo  Zimbabwe             Bulawayo     894701
23014      Bindura  Zimbabwe  Mashonaland Central     895061
23015   Beitbridge  Zimbabwe   Matabeleland South     895269
23016      Epworth  Zimbabwe               Harare    1085510
23017  Chitungwiza  Zimbabwe               Harare    1106542

on a demande a modifier quel est le delimiteur plutot que de le remplacer pour des raisons pratiques, sinon il faudrait remodifier le fichier a chaque mise a jour de ce dernier. et on a rajoute l'en tete

## les bons conseils du professeur

apres avoir importe et stocke un csv :<br/><br/>
<strong>df.shape</strong> pour regarder le nombres de ligne et de colonnes<br/>
<strong>df.dtypes</strong> pour regarder le nom des colonnes et leur type d'un seul coup (j'en profite pour repérer d'éventuel conversion de types qu'il faudra effectuer)<br/>
<strong>df.head()</strong> pour regarder à quoi ressemble les premières lignes du dataset.<br/>
<strong>df.tail()</strong> pour regarder les dernières lignes du dataset. J'en profite pour comparer le résultat de head avec celui de tail, y-a-t'il une quelconque différence? Parfois les anomalies sont rangées à la fin du dataset.<br/>
<strong>df.isna().sum()</strong> pour vérifier la présence de valeurs manquantes par colonnes.<br/>

In [31]:
cheminex="https://bit.ly/bitcoin-data"
dataex=pd.read_csv(cheminex)

In [32]:
dataex.shape

(33, 7)

In [33]:
dataex.dtypes

Date           object
Open*         float64
High          float64
Low           float64
Close**       float64
Volume        float64
Market Cap    float64
dtype: object

In [34]:
dataex.head()

          Date    Open*     High      Low  Close**        Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  4.484178e+10  1.603195e+11
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  2.248291e+10  1.478905e+11
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  2.290344e+10  1.487530e+11
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  2.552117e+10  1.459242e+11
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  2.871458e+10  1.482499e+11

In [35]:
dataex.tail()

,Date,Open*,High,Low,Close**,Volume,Market Cap
28,Dec 17 2019,6931.32,6964.07,6587.97,6640.52,2.236380e+10,1.202342e+11
29,Dec 16 2019,7153.66,7171.17,6903.68,6932.48,2.021327e+10,1.255156e+11
30,Dec 15 2019,7124.24,7181.08,6924.38,7152.30,1.688113e+10,1.294814e+11
31,* Earliest data in range (UTC time),NaN,NaN,NaN,NaN,NaN,NaN
32,** Latest data in range (UTC time),NaN,NaN,NaN,NaN,NaN,NaN

In [36]:
dataex.isna().sum()

Date          0
Open*         2
High          2
Low           2
Close**       2
Volume        2
Market Cap    2
dtype: int64

on constate qu'il y a un probleme qu'on doit regler

In [37]:
dataex=pd.read_csv(cheminex,skipfooter=2)

<ipython-input-37-9a974c9a3621>:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  dataex=pd.read_csv(cheminex,skipfooter=2)

la les tests donneront des resultats plus pertinents car probleme corrige

In [38]:
dataex.shape

(31, 7)

In [39]:
dataex.dtypes

Date           object
Open*         float64
High          float64
Low           float64
Close**       float64
Volume          int64
Market Cap      int64
dtype: object

In [40]:
dataex.head()

          Date    Open*     High      Low  Close**       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [41]:
dataex.tail()

           Date    Open*     High      Low  Close**       Volume    Market Cap
26  Dec 19 2019  7277.59  7346.60  7041.38  7202.84  25904604416  130445758713
27  Dec 18 2019  6647.70  7324.98  6540.05  7276.80  31836522778  131754969804
28  Dec 17 2019  6931.32  6964.07  6587.97  6640.52  22363804217  120234244809
29  Dec 16 2019  7153.66  7171.17  6903.68  6932.48  20213265950  125515586952
30  Dec 15 2019  7124.24  7181.08  6924.38  7152.30  16881129804  129481424648

In [42]:
dataex.isna().sum()

Date          0
Open*         0
High          0
Low           0
Close**       0
Volume        0
Market Cap    0
dtype: int64

la on part sur du csv propre sur lequel on peut travailler

# alteration des tables

les vues : l'utilisation d'inplace<br/>
True on altere l'original<br/>
False on renvoie une vue/copie<br/>

In [43]:
dataex.rename(columns={"Open*":"Open"},inplace=True)

modifie l'original

dataex = dataex.rename(columns={"Open*":"Open"})

fait de meme

dataex["Open*"].rename("Open")

ne modifie pas l'original

In [44]:
dataex.head()

          Date     Open     High      Low  Close**       Volume    Market Cap
0  Jan 14 2020  8140.93  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8189.77  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8033.26  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8162.19  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  7878.31  8166.55  7726.77  8166.55  28714583844  148249907277

In [45]:
dataex.drop("Open",axis='columns', inplace=True)

ici on a definitvement detruit Open et rappeler la fonction renvoierai une erreur

In [46]:
dataex.head()

          Date     High      Low  Close**       Volume    Market Cap
0  Jan 14 2020  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  8166.55  7726.77  8166.55  28714583844  148249907277

In [47]:
dataex.rename(str.lower, axis='columns').head()

          date     high      low  close**       volume    market cap
0  Jan 14 2020  8879.51  8140.93  8827.76  44841784107  160319484883
1  Jan 13 2020  8197.79  8079.70  8144.19  22482910688  147890525973
2  Jan 12 2020  8200.06  8009.06  8192.49  22903438381  148752956966
3  Jan 11 2020  8218.36  8029.64  8037.54  25521165085  145924199942
4  Jan 10 2020  8166.55  7726.77  8166.55  28714583844  148249907277

In [48]:
methode 1 pour remplacer les noms de colonnes problematiques

SyntaxError: invalid syntax (<ipython-input-48-6bc450f30f08>, line 1)

In [ ]:
def modif(s):
    s = s.replace('*','')
    s = s.replace(' ','_')
    return s

In [ ]:
dataex.rename(modif, axis='columns').head()

In [ ]:
dataex.columns.str.replace('*','')

In [ ]:
dataex.columns.str.replace(' ','_')

## mise en pratique

In [ ]:
d = {'col1': [1, 2], 'col2': [3, 4]}

df = pd.DataFrame(data=d)

methode 2 : utilisation du module str

In [49]:
df.columns = df.columns.str.replace('col','in*t ')

NameError: name 'df' is not defined

In [50]:
df

NameError: name 'df' is not defined

methode 1 : rename + mapper

In [51]:
df.rename(modif, axis='columns').head()

NameError: name 'df' is not defined

# transformation des donnees

## extraction des 'str' vers des numeriques

In [52]:
chb="https://bit.ly/bitcoin-purchases2"
dfb=pd.read_csv(chb)

In [53]:
dfb.shape

(1000, 3)

In [54]:
dfb.dtypes

bitcoin address    object
wire amount        object
credit card         int64
dtype: object

In [55]:
dfb.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311,06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032,44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

In [56]:
dfb.tail()

                        bitcoin address wire amount          credit card
995  1Jmz4FMQENDkrtkivVdXM8SiC6ZCJVTDhp     ¥844.68     5541649583285688
996  1GCZKgPV9277czn1RsTYoubCwhbndUvPZU    €1433,63  6304232254235660027
997   1LK2DsWBUmSAsqg7n46sdgg4v2SNrqEPM    €3814,11     3546750658508135
998  1PD6oNfFEnxMsR1PvUvkjHQdHYLCewLJhq    $2900.85  6333272716093574938
999  1B2vk6p7usuV4dfrBMLo8Rzpb5NatTmE8R    $1587.16     4913614335644981

In [57]:
dfb.isna().sum()

bitcoin address    0
wire amount        0
credit card        0
dtype: int64

In [58]:
dfb["wire amount"] = dfb["wire amount"].str.replace(',','.')

In [59]:
dfb.head()

                      bitcoin address wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe    £8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q     €311.06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP    €2032.44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6    ¥8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ    £3265.44   374622922103592

### extraire les devises

dfb['devise'] = dfb["wire amount"].str.get(0)

dfb['devise'] = dfb["wire amount"].str[0]

In [60]:
dfb['wire amount'] = dfb["wire amount"].str.slice(1,None).astype('float')

In [61]:
dfb.dtypes

bitcoin address     object
wire amount        float64
credit card          int64
dtype: object

In [62]:
dfb.head()

                      bitcoin address  wire amount       credit card
0  1J9DVMtgvnPv4KGHL2XSzoTSt5cBBL1DXe      8356.92  3543456448666398
1  1HaiVQbzCTs7t1K1fckYEUi9t8ERBFRR7Q       311.06  3584615208479876
2  1NGPjXfDScEUSZYajAzCkxaVApTbBHC7jP      2032.44  6370577480710876
3  15cSYRTbcrxYinxNxk7VbkPLZG8nypdjy6      8155.74  4508652385157398
4  18j2qG1DH9YduJiBiccAq8Ak897G3E4JyZ      3265.44   374622922103592

In [63]:
import random
def makeNumberStr(sep=[',']):
    avantvirg = str(random.randint(1,1000))
    apresvirg = '{:02}'.format(random.randint(0,99))
    sep = random.choice(sep)
    return avantvirg + sep + apresvirg

col1 = [makeNumberStr() for _ in range(200)]
col2 = [makeNumberStr(['.',',']) for _ in range(200)]

exo1 = pd.DataFrame(data={"col1":col1,
                         "col2":col2})

In [64]:
exo1["col1"] = exo1["col1"].str.replace(',','.').astype('float')

In [65]:
exo1["col2"] = exo1["col2"].str.replace(',','.').astype('float')

In [66]:
exo1.head()

     col1    col2
0  230.03  321.71
1  342.28  683.20
2  725.72  355.05
3  100.70  642.14
4  924.95  757.78

In [67]:
def makeNumberStrRandSign(sep=[','],signs=['€','$']):
    avantvirg = str(random.randint(1,1000))
    apresvirg = '{:02}'.format(random.randint(0,99))
    sep = random.choice(sep)
    sign = random.choice(signs)
    return avantvirg + sep + apresvirg + sign

col1 = [makeNumberStrRandSign() for _ in range(200)]
col2 = [makeNumberStrRandSign(['.',',']) for _ in range(200)]

exo2 = pd.DataFrame(data={"col1":col1,
                         "col2":col2})

In [68]:
exo2['devisecol1'] = exo2["col1"].str[-1]
exo2['devisecol2'] = exo2["col2"].str[-1]
exo2["col1"] = exo2["col1"].str.replace(',','.')
exo2["col2"] = exo2["col2"].str.replace(',','.')
exo2["col1"] = exo2["col1"].str.slice(None,-1).astype('float')
exo2["col2"] = exo2["col2"].str.slice(None,-1).astype('float')

for i in [1,2]:
    exo2['devisecol{i}'] = exo2["col{i}"].str[-1]
    exo2["col{i}"] = exo2["col{i}"].str.replace(',','.')
    exo2["col{i}"] = exo2["col{i}"].str.slice(None,-1).astype('float')

In [69]:
exo2.head()

     col1    col2 devisecol1 devisecol2
0  343.49  922.54          €          €
1  123.62  183.96          $          $
2  302.84  974.17          $          €
3   24.99  350.79          €          €
4  956.10  798.74          €          $

## extraction des 'int'/'float' vers des ordinal

In [70]:
df="https://bit.ly/felonies-dataset"
dfb=pd.read_csv(df)

In [71]:
dfb.head()

        Date of Arrest  Age Convicted
0  2014-07-16 14:59:18   77       Yes
1  2002-12-19 22:17:59   28       Yes
2  1994-06-28 09:31:40   21        No
3  1985-05-14 09:52:17   45       Yes
4  1985-05-25 14:06:28   39       Yes

on va categoriser les ages en tranches

In [72]:
dfb['Age'].describe()

count    1000.000000
mean       54.605000
std        25.225172
min        10.000000
25%        33.000000
50%        53.000000
75%        76.000000
max        99.000000
Name: Age, dtype: float64

In [73]:
pd.cut('Age',bins=[10,14,20,6,100],labels=['Child','Ado','Adulte','Senior'])

ValueError: Input array must be 1 dimensional

In [74]:
dfb.isna().sum()

Date of Arrest    0
Age               0
Convicted         0
dtype: int64

### exemple

In [75]:
exo3= pd.Series(data=[0,1,2,3,4,5])

In [76]:
pd.cut(exo3,bins=[1,2,3],labels=['A','B'])

0    NaN
1    NaN
2      A
3      B
4    NaN
5    NaN
dtype: category
Categories (2, object): ['A' < 'B']

on constate que les bornes, par ex : [0,1] c'est techniquement [0.001,1]

In [77]:
prefix = ["ten","twen","thir","four","fif","six","seven","eigh","nine"]
labels = [p+'ties' for p in prefix]

### reprise

In [78]:
bins = [i for i in range(9,100,10)]

In [79]:
dfb['Decades'] = pd.cut(dfb['Age'],bins=bins,labels=labels)

## extraction des 'date' vers des numeriques

In [80]:
dfb['Date of Arrest'] = pd.to_datetime(dfb['Date of Arrest'])
dfb.head()

       Date of Arrest  Age Convicted    Decades
0 2014-07-16 14:59:18   77       Yes  seventies
1 2002-12-19 22:17:59   28       Yes   twenties
2 1994-06-28 09:31:40   21        No   twenties
3 1985-05-14 09:52:17   45       Yes   fourties
4 1985-05-25 14:06:28   39       Yes   thirties

In [81]:
from datetime import datetime
year = lambda y: datetime(year=y,month=1, day=1)
prefix = ["six","seven","eigh","nine","ten","twen","thir"]
labels = [p+'ties' for p in prefix]
bins =  list(range(1959,2030,10))
bins = [year(b) for b in bins]

In [94]:
dfb.rename(columns={"Date of Arrest":"DoA"},inplace=True)
dfb['YoA']=dfb['DoA'].dt.year

## methode avec mapping

In [83]:
data=pd.read_csv("https://bit.ly/felonies-dataset")
data['DoA']=pd.to_datetime(data['Date of Arrest'])
data.dtypes

Date of Arrest            object
Age                        int64
Convicted                 object
DoA               datetime64[ns]
dtype: object

In [84]:
data.drop(['Date of Arrest'], axis='columns', inplace=True)
data.head()

   Age Convicted                 DoA
0   77       Yes 2014-07-16 14:59:18
1   28       Yes 2002-12-19 22:17:59
2   21        No 1994-06-28 09:31:40
3   45       Yes 1985-05-14 09:52:17
4   39       Yes 1985-05-25 14:06:28

In [85]:
dow2weektime={0:'Debut',1:'Debut',
              2:'Milieu',3:'Milieu',4:'Milieu',
              5:'Weekend',6:'Weekend'}
data.DoA.dt.dayofweek.map(dow2weektime)

0       Milieu
1       Milieu
2        Debut
3        Debut
4      Weekend
        ...
995      Debut
996      Debut
997      Debut
998      Debut
999    Weekend
Name: DoA, Length: 1000, dtype: object

In [86]:
id2str=['monday','tuesday','wednesday','thursday','friday','saturday','sunday']
str2id={value: idx for idx, value in enumerate(id2str)}
str2id

{'monday': 0,
 'tuesday': 1,
 'wednesday': 2,
 'thursday': 3,
 'friday': 4,
 'saturday': 5,
 'sunday': 6}

In [87]:
id2str={idx:value for idx, value in enumerate(id2str)}
id2str

{0: 'monday',
 1: 'tuesday',
 2: 'wednesday',
 3: 'thursday',
 4: 'friday',
 5: 'saturday',
 6: 'sunday'}

In [88]:
data['DoA'].dt.dayofweek.map(id2str)

0      wednesday
1       thursday
2        tuesday
3        tuesday
4       saturday
         ...
995      tuesday
996       monday
997      tuesday
998       monday
999       sunday
Name: DoA, Length: 1000, dtype: object

In [89]:
periodeSemaine={'monday': 'debut',
                'tuesday': 'debut',
                'wednesday': 'milieu',
                'thursday': 'milieu',
                'friday': 'milieu',
                'saturday': 'week-end',
                'sunday': 'week-end'}

In [90]:
data['periodeSemaine']=data['DoA'].dt.dayofweek.map(id2str).map(periodeSemaine)
data.head()

   Age Convicted                 DoA periodeSemaine
0   77       Yes 2014-07-16 14:59:18         milieu
1   28       Yes 2002-12-19 22:17:59         milieu
2   21        No 1994-06-28 09:31:40          debut
3   45       Yes 1985-05-14 09:52:17          debut
4   39       Yes 1985-05-25 14:06:28       week-end

Bonus : Sauvegarder des objets
Méthode intéressante pour sauvegarder le vocabulaire et pouvoir le réutiliser

A Savoir : On ne peut pas pickle des objets numpy

import pickle
path=(' ./dictionnaire.pkl')

#en écriture
with open (path, 'wb') as f:
    pickle.dump(id2str,f) #pickle.dump(object, directory)
    
#en lecture
with open (path, 'rb') as f:
    objet=pickle.load(f) #pickle.dump(object, directory)
objet

## extraction des 'date' vers des ordinal

In [102]:
data=pd.read_csv("https://bit.ly/felonies-dataset")
data.rename(columns={"Date of Arrest":"DoA"}, inplace=True)
data['DoA']=pd.to_datetime(data['DoA'])
data.head()

                  DoA  Age Convicted
0 2014-07-16 14:59:18   77       Yes
1 2002-12-19 22:17:59   28       Yes
2 1994-06-28 09:31:40   21        No
3 1985-05-14 09:52:17   45       Yes
4 1985-05-25 14:06:28   39       Yes

In [103]:
print("Les jours vont de",
      data['DoA'].dt.day.min(),
      "à",
      data['DoA'].dt.day.max())
print("Les mois vont de",
      data['DoA'].dt.month.min(),
      "à",
      data['DoA'].dt.month.max())

Les jours vont de 1 à 31
Les mois vont de 1 à 12

In [104]:
coltemp=data['DoA'].dt.month*100+data['DoA'].dt.day
coltemp

0       716
1      1219
2       628
3       514
4       525
       ...
995     204
996     429
997     715
998     705
999     317
Name: DoA, Length: 1000, dtype: int64

In [105]:
av_janvier=0
av_printmps=320
av_ete=620
av_autmn=920
av_hiver=1221
fin_année=1232
bins=[av_janvier,av_printmps,av_ete,av_autmn,av_hiver,fin_année]
saisons=pd.cut(coltemp,
      bins=bins,
      labels=['HIVER','PRINTEMPS','ETE','AUTOMNE','HIVER2'])
saisons.head()

0          ETE
1      AUTOMNE
2          ETE
3    PRINTEMPS
4    PRINTEMPS
Name: DoA, dtype: category
Categories (5, object): ['HIVER' < 'PRINTEMPS' < 'ETE' < 'AUTOMNE' < 'HIVER2']

In [106]:
saisons=saisons.str.replace('2','')
saisons.unique()

array(['ETE', 'AUTOMNE', 'PRINTEMPS', 'HIVER'], dtype=object)

In [107]:
ordre=['HIVER','PRINTEMPS','ETE','AUTOMNE']
saison=(saisons.astype('category').
                        cat.reorder_categories(ordre).
                        cat.as_ordered())
saison.head()

0          ETE
1      AUTOMNE
2          ETE
3    PRINTEMPS
4    PRINTEMPS
Name: DoA, dtype: category
Categories (4, object): ['HIVER' < 'PRINTEMPS' < 'ETE' < 'AUTOMNE']

### on faire pareil avec les periodes des jours

In [118]:
data=pd.read_csv("https://bit.ly/felonies-dataset")
data.rename(columns={"Date of Arrest":"DoA"}, inplace=True)
data['DoA']=pd.to_datetime(data['DoA'])
data.head()

                  DoA  Age Convicted
0 2014-07-16 14:59:18   77       Yes
1 2002-12-19 22:17:59   28       Yes
2 1994-06-28 09:31:40   21        No
3 1985-05-14 09:52:17   45       Yes
4 1985-05-25 14:06:28   39       Yes

In [119]:
print("Les min vont de",
      data['DoA'].dt.minute.min(),
      "à",
      data['DoA'].dt.minute.max())
print("Les heures vont de",
      data['DoA'].dt.hour.min(),
      "à",
      data['DoA'].dt.hour.max())

Les min vont de 0 à 59
Les heures vont de 0 à 23

In [120]:
coltemp=data['DoA'].dt.hour*100+data['DoA'].dt.minute
coltemp

0      1459
1      2217
2       931
3       952
4      1406
       ...
995    1424
996    1803
997    2159
998    1716
999    1829
Name: DoA, Length: 1000, dtype: int64

In [121]:
db_jour=0
db_matn=325
db_jrne=1200
db_soir=1830
db_nuit=2215
fn_jour=2359
bins=[db_jour,db_matn,db_jrne,db_soir,db_nuit,fn_jour]
periodes=pd.cut(coltemp,
      bins=bins,
      labels=['NUIT','MATIN','JOURNEE','SOIREE','NUIT2'])
periodes.head()

0    JOURNEE
1      NUIT2
2      MATIN
3      MATIN
4    JOURNEE
Name: DoA, dtype: category
Categories (5, object): ['NUIT' < 'MATIN' < 'JOURNEE' < 'SOIREE' < 'NUIT2']

In [122]:
periodes=periodes.str.replace('2','')
periodes.unique()

array(['JOURNEE', 'NUIT', 'MATIN', 'SOIREE'], dtype=object)

In [124]:
ordre=['NUIT','MATIN','JOURNEE','SOIREE']
periode=(periodes.astype('category').
                        cat.reorder_categories(ordre).
                        cat.as_ordered())
periode.head()

0    JOURNEE
1       NUIT
2      MATIN
3      MATIN
4    JOURNEE
Name: DoA, dtype: category
Categories (4, object): ['NUIT' < 'MATIN' < 'JOURNEE' < 'SOIREE']

## gestion des manquants

In [228]:
data=pd.read_csv("https://bit.ly/missing-values")

In [229]:
data.head()

  color  rating
0   NaN    1.16
1   Red     NaN
2  Blue    2.54
3   Red    1.51
4   Red     NaN

In [230]:
data['color_missing'] = data['color'].isna()
data.insert(1,'_missing',data["color"].str[0])

In [231]:
data.head()

  color _missing  rating  color_missing
0   NaN      NaN    1.16           True
1   Red        R     NaN          False
2  Blue        B    2.54          False
3   Red        R    1.51          False
4   Red        R     NaN          False

inserer une colonne pour renseigner la presence de valeur manquantte en numerique / ordinal

In [232]:
# ne faire ca qu'avec les colonnes numeriques ou ordinales
for nom_colonne in ['color','rating']:
    index_colonne = data.columns.get_loc(nom_colonne)
    data.insert(index_colonne+1,nom_colonne +'_nan', data[nom_colonne].isna().astype('int8'))

In [233]:
data.head()

  color  color_nan _missing  rating  rating_nan  color_missing
0   NaN          1      NaN    1.16           0           True
1   Red          0        R     NaN           1          False
2  Blue          0        B    2.54           0          False
3   Red          0        R    1.51           0          False
4   Red          0        R     NaN           1          False

la touche finale pour les colonnes ordinales c'est colonne.cat.codes

et pour les numeriques rajouter as_type('int') ou 'float'

### detruire les nan

on peut supprimer les lignes avec les nan

data.dropna(how="", subsest=['', ...])

pour how on peut mettre any ou all, any c'est des qu'il trouve une ligne avec une valeur nulle dans une des colonnes de subset

pour all il faut que ca concerne toute les colonnes de subset pour une ligne

### exemple de drop

In [238]:
data=pd.read_csv("https://bit.ly/missing-values-toy")

In [239]:
data.head()

  Colonne Importante  Colonne Inutile  Colonne Peu Utile
0                Oui              NaN                2.0
1                Non              1.0                NaN
2         Légerement              NaN                3.0
3                NaN              1.0                NaN
4                Oui              1.0                4.0

In [243]:
data.dropna(how='any',subset=['Colonne Importante'])

  Colonne Importante  Colonne Inutile  Colonne Peu Utile
0                Oui              NaN                2.0
1                Non              1.0                NaN
2         Légerement              NaN                3.0
4                Oui              1.0                4.0

si on veut etre plus specfique

In [246]:
data.dropna(how='all',subset=['Colonne Importante','Colonne Peu Utile'])

  Colonne Importante  Colonne Inutile  Colonne Peu Utile
0                Oui              NaN                2.0
1                Non              1.0                NaN
2         Légerement              NaN                3.0
4                Oui              1.0                4.0
5                NaN              NaN                3.0

### remplir les vides

In [268]:
data=pd.read_csv("https://bit.ly/missing-values")

In [270]:
for nom_col in ['color','rating']:
    idx= data.columns.get_loc(nom_col)
    data.insert(idx+1,nom_col+'_nan', data[nom_col].isna().astype('int'))

In [271]:
data.head()

  color  color_nan  rating  rating_nan
0   NaN          1    1.16           0
1   Red          0     NaN           1
2  Blue          0    2.54           0
3   Red          0    1.51           0
4   Red          0     NaN           1

data['color'].fillna('ce que tu veux')

la il n'y a pas de bonne solution mais y a des methodes:<br/>
mettre l'element le plus frequente<br/>
mettre la moyenne ou la mediane<br/>
mettre une valeur hors limite<br/>

In [283]:
data['rating'].fillna(data['rating'].mean())

0      1.160000
1      3.066672
2      2.540000
3      1.510000
4      3.066672
         ...
912    3.400000
913    3.066672
914    1.240000
915    2.640000
916    3.066672
Name: rating, Length: 917, dtype: float64

In [282]:
data['color'].value_counts()

Blue      323
Red       234
Orange    154
Yellow     77
Name: color, dtype: int64

In [280]:
data['color'].fillna(data['color'].mode().item())

0        Blue
1         Red
2        Blue
3         Red
4         Red
        ...
912      Blue
913       Red
914      Blue
915    Yellow
916      Blue
Name: color, Length: 917, dtype: object

In [276]:
data['color'].fillna('Manquant')

0      Manquant
1           Red
2          Blue
3           Red
4           Red
         ...
912        Blue
913         Red
914    Manquant
915      Yellow
916        Blue
Name: color, Length: 917, dtype: object

In [277]:
data['rating'].max()

5.0

In [278]:
data['rating'].min()

1.0

In [279]:
data['rating'].fillna(0)

0      1.16
1      0.00
2      2.54
3      1.51
4      0.00
       ...
912    3.40
913    0.00
914    1.24
915    2.64
916    0.00
Name: rating, Length: 917, dtype: float64

### utilisation des dummies

In [296]:
data=pd.read_csv("https://bit.ly/missing-values")

In [297]:
for nom_colonne in ['rating']:
    index_colonne = data.columns.get_loc(nom_colonne)
    data.insert(index_colonne+1,nom_colonne +'_nan', data[nom_colonne].isna().astype('int8'))
data['rating'].fillna(data['rating'].mean(),inplace=True)

In [298]:
data.dtypes

color          object
rating        float64
rating_nan       int8
dtype: object

ici la colonne couleur n'est ni propice a l'analyse humaine
ni a l'analyse machine / automatique<br/>
en manuelle on aurait du float int category ou datetime<br/>
en auto on aurait float ou int <br/>

In [299]:
data['color']= data['color'].astype('category')

In [300]:
data.dtypes

color         category
rating         float64
rating_nan        int8
dtype: object

la ok pour le manuel mais pas en auto et c'est avec getdummies qu'on va transformer ces donnees en trucs lisibles pour les automates

In [302]:
pd.get_dummies(data,dummy_na=True,columns=['color'])

,rating,rating_nan,color_Blue,color_Orange,color_Red,color_Yellow,color_nan
0,1.160000,0,0,0,0,0,1
1,3.066672,1,0,0,1,0,0
2,2.540000,0,1,0,0,0,0
3,1.510000,0,0,0,1,0,0
4,3.066672,1,0,0,1,0,0
...,...,...,...,...,...,...,...
912,3.400000,0,1,0,0,0,0
913,3.066672,1,0,0,1,0,0
914,1.240000,0,0,0,0,0,1
915,2.640000,0,0,0,0,1,0
916,3.066672,1,1,0,0,0,0

ca nous permet de ne pas le faire a la main et de garder un tableau simplifie de notre cote

parfiois on activera la fonction drop first pour retirer la premiere colonne car techniquement avec les autres on sait les valeurs de celle ci (quand elles ont toute zero sur une ligne)

## les doublons

In [248]:
data=pd.read_csv("https://bit.ly/tx-data")
data.head()

  transaction_id first_name  last_name       ip_address   amount
0      50563-403     Jacobo   Haresign    18.144.134.48  $647.77
1     54569-3911    Christy       Derl  254.107.123.242  $460.47
2     59667-0024     Florie     Prewer    148.80.11.233  $565.38
3      60429-123     Danika     Shimuk   233.91.221.158  $794.76
4      0187-0771   Annelise  Antonescu   238.143.41.105  $790.41

In [252]:
data.duplicated().head()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [253]:
data.duplicated(keep='last').head()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [254]:
data.duplicated(keep=False).head()

0    False
1    False
2     True
3    False
4    False
dtype: bool

avec ca on peut utiliser un masques pour n'avoir acces qu'aux non dupliques

In [256]:
data[data.duplicated()]

   transaction_id first_name   last_name       ip_address   amount
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

toutes ces donnnes sont apparus au moins une fois

In [257]:
data[data.duplicated(keep=False)]

   transaction_id first_name   last_name       ip_address   amount
2      59667-0024     Florie      Prewer    148.80.11.233  $565.38
5       53942-299      Upton        Emig  103.190.123.125  $759.53
7       60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
12      68180-751     Marlon      Fernie   61.133.100.141  $974.30
14      65862-207     Alvira      Heifer   141.170.128.72  $584.13
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
16      0066-0508       Jedd     Hartman     21.55.247.91  $749.96
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

la on aura tous les exemplaires des duplicatas

et si on veut par rapport a une colonne en particulier :

In [261]:
data[data.duplicated(keep=False, subset=['first_name'])]

   transaction_id first_name   last_name       ip_address   amount
2      59667-0024     Florie      Prewer    148.80.11.233  $565.38
5       53942-299      Upton        Emig  103.190.123.125  $759.53
7       60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
12      68180-751     Marlon      Fernie   61.133.100.141  $974.30
14      65862-207     Alvira      Heifer   141.170.128.72  $584.13
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30
16      0066-0508       Jedd     Hartman     21.55.247.91  $749.96
18     44887-2589     Sergio  Whittlesee   76.116.223.149   $346.1
19      53942-299      Upton        Emig  103.190.123.125  $759.53
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
29     43857-0134     Sergio  Whittlesee   76.116.223.149  $346.11
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96

ici la cle primaire est transaction_id donc c'est sur cette colonne qu'on va verifier

In [265]:
data[data.duplicated(keep=False,subset=['transaction_id'])].sort_values('transaction_id')

   transaction_id first_name   last_name       ip_address   amount
16      0066-0508       Jedd     Hartman     21.55.247.91  $749.96
42      0066-0508       Jedd     Hartman     21.55.247.91  $749.96
5       53942-299      Upton        Emig  103.190.123.125  $759.53
19      53942-299      Upton        Emig  103.190.123.125  $759.53
2      59667-0024     Florie      Prewer    148.80.11.233  $565.38
28     59667-0024     Florie      Prewer    148.80.11.233  $565.38
7       60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
20      60289-247      Corri  Rockcliffe    46.150.208.18    $5.68
14      65862-207     Alvira      Heifer   141.170.128.72  $584.13
32      65862-207     Alvira      Heifer   141.170.128.72  $584.13
37      65862-207     Alvira      Heifer   141.170.128.72  $584.13
12      68180-751     Marlon      Fernie   61.133.100.141  $974.30
15      68180-751     Marlon      Fernie   61.133.100.141  $974.30

In [267]:
data.drop_duplicates(subset='transaction_id', inplace=True)

## en gros

donnees sales:
    rituel d'ouverture (voir les bons conseils)
    extreacton des val num
    extraction des categories
    transformer les categories qu'il faut en ordinal
    extraires des dates les infos interessantes
pret pour l'analyse
    encoder les ordinales
    marquer les valeures manquantes
    utiliser get dummies sur les categories
    supprimer les donnees inutiles
pret pour le ML

pour sauvegarder les dataframes modifiee en csv

data.to_csv('nom_fichier.csv',index=None)

sans index =none il va rajouter en debut l'index actuel

# mise en pratique du cours

## dataset cours

In [317]:
data=pd.read_csv("https://bit.ly/vintage-auctions")
data.head()

,tx id,time,auction,color,shirt size,condition
0,8dbf3cfa48b25f32e300f279bb4163c67d5c60cd,3:36 PM,$17.18,Puce,S,used
1,8ccebfdb1a41830bdcc0e926531f3215986b3a90,9:03 AM,$15.19,Aquamarine,L,never worn
2,ae85a421a91cec8baf16ff1e45fb3e239130b584,7:42 PM,$7.58,Violet,L,used
3,85e44f09a04a79182befcfd55e288a855f633e81,10:28 PM,$9.10,Goldenrod,XS,NaN
4,ff750bfca4910cfa7f538fbe5463457839021680,6:38 AM,$8.22,NaN,2XL,used

In [318]:
data.dtypes

tx id         object
time          object
auction       object
color         object
shirt size    object
condition     object
dtype: object

In [319]:
data.shape

(1000, 6)

In [320]:
data.tail()

,tx id,time,auction,color,shirt size,condition
995,6fa16b110f53367cf15e6e1dcffdcb4c2653f1ab,9:56 AM,$5.79,Violet,2XL,NaN
996,2b7b6cbc2224502c7137262575e97a450b336fc2,11:31 AM,$14.07,Purple,S,Used
997,7f2a5141de8a7f752f8f98722393ffa3b0fb1e7a,6:25 AM,$17.63,Yellow,XS,used
998,c4549687dee4d3061fd3c82433367bea083d4d05,2:22 AM,$17.00,Yellow,L,Used
999,abf227d09fe37b3e333b419e0854c6c2fd1caa50,7:47 PM,$17.05,Indigo,XL,used

In [321]:
data.isna().sum()

tx id           0
time            0
auction         0
color          23
shirt size      0
condition     153
dtype: int64

In [322]:
data.isna().mean()

tx id         0.000
time          0.000
auction       0.000
color         0.023
shirt size    0.000
condition     0.153
dtype: float64

In [323]:
data.rename(columns={"shirt size":"shirt_size"}, inplace=True)
data.rename(columns={"tx id":"tx_id"}, inplace=True)

In [324]:
data["auction"] = data["auction"].str.replace(',','.')

In [325]:
data.insert(3,'devise',data["auction"].str[0])

data['devise'] = data["auction"].str[0]

In [326]:
data['auction'] = data["auction"].str.slice(1,None).astype('float')

In [327]:
data.head()

,tx_id,time,auction,devise,color,shirt_size,condition
0,8dbf3cfa48b25f32e300f279bb4163c67d5c60cd,3:36 PM,17.18,$,Puce,S,used
1,8ccebfdb1a41830bdcc0e926531f3215986b3a90,9:03 AM,15.19,$,Aquamarine,L,never worn
2,ae85a421a91cec8baf16ff1e45fb3e239130b584,7:42 PM,7.58,$,Violet,L,used
3,85e44f09a04a79182befcfd55e288a855f633e81,10:28 PM,9.10,$,Goldenrod,XS,NaN
4,ff750bfca4910cfa7f538fbe5463457839021680,6:38 AM,8.22,$,NaN,2XL,used

minutes = data["time"].str.slice(-5,-2).astype('int')
heures = data["time"].str.slice(None,-6).astype('int')
pm = data['time'].str.contains('PM')
for i in range(len(pm)):
    if pm[i]:
        heures[i]+=12

In [347]:
data['time'] = pd.to_datetime(data['time'], format='%I:%M %p')

In [348]:
data['time'].dt.hour.min()

0

In [349]:
data['time'].dt.hour.max()

23

In [350]:
coltemp=data['time'].dt.hour*100+data['time'].dt.minute
coltemp

0      1536
1       903
2      1942
3      2228
4       638
       ...
995     956
996    1131
997     625
998     222
999    1947
Name: time, Length: 1000, dtype: int64

In [351]:
db_jour=0
db_matn=600
db_jrne=1200
db_soir=1830
db_nuit=2200
fn_jour=2359
bins=[db_jour,db_matn,db_jrne,db_soir,db_nuit,fn_jour]
periodes=pd.cut(coltemp,
      bins=bins,
      labels=['NUIT','MATIN','JOURNEE','SOIREE','NUIT2'])
periodes.head()

0    JOURNEE
1      MATIN
2     SOIREE
3      NUIT2
4      MATIN
Name: time, dtype: category
Categories (5, object): ['NUIT' < 'MATIN' < 'JOURNEE' < 'SOIREE' < 'NUIT2']

In [352]:
periodes=periodes.str.replace('2','')
periodes.unique()

array(['JOURNEE', 'MATIN', 'SOIREE', 'NUIT'], dtype=object)

In [353]:
ordre=['NUIT','MATIN','JOURNEE','SOIREE']
periode=(periodes.astype('category').
                        cat.reorder_categories(ordre).
                        cat.as_ordered())

In [356]:
data['time']=periode

In [359]:
data.head()

,tx_id,time,auction,devise,color,shirt_size,condition
0,8dbf3cfa48b25f32e300f279bb4163c67d5c60cd,JOURNEE,17.18,$,Puce,S,used
1,8ccebfdb1a41830bdcc0e926531f3215986b3a90,MATIN,15.19,$,Aquamarine,L,never worn
2,ae85a421a91cec8baf16ff1e45fb3e239130b584,SOIREE,7.58,$,Violet,L,used
3,85e44f09a04a79182befcfd55e288a855f633e81,NUIT,9.10,$,Goldenrod,XS,NaN
4,ff750bfca4910cfa7f538fbe5463457839021680,MATIN,8.22,$,NaN,2XL,used

In [360]:
data['devise'].value_counts()

$    1000
Name: devise, dtype: int64

In [ ]:
data.drop(columns='devise',inplace=True)

In [368]:
data['shirt_size'].value_counts()

XS     157
3XL    152
S      149
M      148
XL     141
2XL    129
L      124
Name: shirt_size, dtype: int64

In [371]:
data['shirt_size'].value_counts().index

Index(['XS', '3XL', 'S', 'M', 'XL', '2XL', 'L'], dtype='object')

In [374]:
ordre=['XS','S','M','L','XL','2XL','3XL']
taille=(data['shirt_size'].astype('category').
                        cat.reorder_categories(ordre).
                        cat.as_ordered())

In [375]:
taille.head()

0      S
1      L
2      L
3     XS
4    2XL
Name: shirt_size, dtype: category
Categories (7, object): ['XS' < 'S' < 'M' < 'L' < 'XL' < '2XL' < '3XL']

In [376]:
data['shirt_size']=taille

## dataset diamants

## dataset titanic